<template>
    <div>
        <div class="title flex items-center gap-4">
            <span>Experiences</span>
            <select v-model="showYears" class="text-sm">
                <option value="5">近5年</option>
                <option value="10">近10年</option>
                <option value="100">全部</option>
            </select>
        </div>
        <timeline-item
            v-for="(e, index) in getLatestYearsExp(parseInt(showYears, 10))"
            :key="index"
        >
            <template #left>{{ e.date }}</template>
            <template #right-company>{{ e.company }}</template>
            <template #right-product>{{ e.product }}</template>
            <template #right-description>
                <div class="marked-content">
                    <div v-html="parser.parse(e.description.trim())"></div>
                </div>
                <div class="flex mt-1 flex-wrap gap-1.5 pl-4" v-if="e.points">
                    <span
                        v-for="(p, pIndex) in e.points"
                        :key="pIndex"
                        class="inline-flex px-2 py-0.5 bg-gray-200 rounded text-xs"
                        >{{ p }}</span
                    >
                </div>
            </template>
        </timeline-item>
    </div>
</template>
<script lang="ts" setup>
import { Marked } from 'marked'
import { ref } from 'vue'
import TimelineItem from './TimelineItem.vue'

const parser = new Marked()

const showYears = ref('5')
const experiences = [
    {
        date: '2025-09',
        company: '医二科技',
        product: '',
        description: `
- **新版模型评测平台**：前后端均由本人开发；支持Base与Chat模型评测；支持200多种数据集；支持主观与客观评测；支持多模态模型评测；支持集群部署评测自动发现可用资源；支持多种评测后端（OpenCompass、EvalScope）；支持结果对比统计与日志查看；前端使用Vue3，后端使用Python开发，使用Ray分布式框架进行模型推理与评测任务管理，对于Chat模型可使用VLLM或SGLang来推理；
- **患者招募小程序**：作为前端，使用Vue开发；支持患者通过上传资料来匹配临床试验，同时支持患者与模型对话询问试验或匹配信息
- **知识管理平台**：全栈，部分参与；前端使用Vue，后端使用Python开发，基于[🔗DDD领域设计及应用架构](https://cungen.github.io/notes/Cards/DDD%E9%A2%86%E5%9F%9F%E8%AE%BE%E8%AE%A1%E5%8F%8A%E5%BA%94%E7%94%A8%E6%9E%B6%E6%9E%84)；**大模型生成~80%代码**
`,
        points: ['Python', 'Ray', 'Vue3'],
    },
    {
        date: '2024-09',
        company: '医二科技',
        product: '',
        description: `
- **旧版模型评测平台**：前后端均有参与；支持起模型推理服务、自定义上传与修改数据集、评测结果查看；前端使用Vue3开发；后端使用Python开发，使用Ray起模型服务；主要是维护和功能修复及页面优化；
- **模型训推一体机平台**：前后端均有参与，支持模型微调(基于LlamaFactory)、模型推理服务、Agent管理；前端使用Vue3开发；后端使用Python开发；其中用户管理前后端，评测部分前后端均由本人完成开发，且开发中使用**大模型生成~70%代码**；
- **健康管理小程序**：作为前端，使用Vue开发；有模型对话、健康宣教、健康日历、用户管理等功能；前端使用Vue3开发；`,
        points: ['Python', 'Ray', 'Vue3'],
    },
    {
        date: '2023-09',
        company: '医渡云技术有限公司',
        product: '全病种、患者管理平台、专病数据库、AI建模平台',
        description: `
- 现有产品迭代；
- AI建模平台；满足用户其于现有数据，对数据进行纳排、展示、预处理及建模的整个流程，前端采用Vue3开发；
- 团队管理，团队目标设定、人员排期、每周分享`,
        points: ['团队管理', 'Vue3', 'Monorepo'],
    },
    {
        date: '2022',
        company: '医渡云技术有限公司',
        product: '全病种、患者管理平台、专病数据库',
        description: `
- 2款新的产品开发，其中全病种是专病库的延伸，用户可以在该平台中基于纳排创建自己的专病库，患者管理平台涉及PC端及公众号，满足用户对患者的管理需求，包含医患者沟通IM及随访管理、宣教知识管理等，前端采用Vue开发，移动端采用UniApp开发；
- 现有产品优化，其中包含一个复杂功能(项目抽取及导出)的**性能优化**；
- 团队管理，团队目标设定、人员使用情况、项目排期、每周分享`,
        points: ['团队管理', '性能优化', 'Vue', 'UniApp', 'Monorepo'],
    },
    {
        date: '2021',
        company: '医渡云技术有限公司',
        product: '疾病数据中心、专病数据库',
        description: `
- 现有产品迭代，及部分业务尝试需求开发；
- 患者时间轴页面优化(**D3优化**)；
- 团队管理，团队目标设定、人员使用情况、项目排期、每周分享`,
        points: ['团队管理', 'Vue', 'D3'],
    },
    {
        date: '2020',
        company: '医渡云技术有限公司',
        product: '互联网医院、专病数据库',
        description: `
- 互联网医院，提供医患沟通、线上问诊、在线开方等功能，参与了移动端公众号相关页面开发；
- 时间轴可视化配置工具的开发，由本人单独完成页面展现及交互的设计与开发，迭代了数次，在组内广泛使用，可满足90%的配置需求；`,
        points: ['移动端', '产品思维', 'Vue'],
    },
    {
        date: '2019',
        company: '医渡云技术有限公司',
        product: '疾病数据中心、科研协作平台',
        description:
            '疾病数据中心项目，该产品是整合的专病库及科研协作平台，即有多中心的项目管理逻辑，又有基于专病库的纳排及抽取功能，前端采用Vue开发，其中项目初始化及页面结构、导航等的搭建工作及部分页面由本人开发； 专病库性能优化，主是要针对Vue的整体加载性能及大数据量表格渲染性能的优化工作； 患者时间轴样式优化，主要是时间轴页面各组件及d3绘图方法的优化工作；',
        points: ['框架搭建', 'Vue', '性能优化', 'D3'],
    },
    {
        date: '2018',
        company: '医渡云技术有限公司',
        product: '专病数据库',
        description:
            '患者搜索全家桶的复杂组件开发，整合了原来3种搜索方式，对搭建复杂业务组件有了相关的经验； Vue埋点库开发，可以记录用户的点击，页面跳转及页面停留时长的工具类库 ',
        points: ['复杂业务', 'Vue', '埋点工具'],
    },
    {
        date: '2017',
        company: '医渡云技术有限公司',
        product: '专病数据库',
        description:
            '针对某一病种的科研平台, 对该病种关心的数据，做更有针对性的结构化的一款产品，由本人初始化框架, 采用Vue及Vuex开发, 使用了ElementUI并定制化了样式及组件； 患者时间轴页面的开发，采用d3开发，可以通过配置来展示用户关注的患者的相关医疗事件 ',
        points: ['框架搭建', 'Vue', 'D3'],
    },
    {
        date: '2016-08',
        company: '医渡云技术有限公司',
        product: '科研平台',
        description:
            '帮助医生进行科研探索和科研项目管理的一个产品, 包括了一个内网单中心版本和公网多中心版本及垮平台的移动端, 同样采用angular开发, d3和highchart做数据可视化, 使用我们自己的组件库来进行页面组织, 后由本人重构过一版, 加入了webpack和es6的方式来模块化angular, 移动端也由本人维护一段时间和重构过一次使用Ionic开发, 加入了代码热补丁 ',
        points: ['Angular', 'D3', '手机端', 'Ionic'],
    },
    {
        date: '2015-08',
        company: '医渡云技术有限公司',
        product: '医渡搜索',
        description:
            '病历搜索和患者的医疗事件详情页，早期采用node的express+angular，后因前后端分离， 前端页面重构只采用了angular后端由python开发, 其中样式框架的组织，专家搜索， 用户反馈及搜索历史的记录与还原等均由本人开发完成；我们开发了自己的组件和样式库，项目中也同时用到了highchart,d3等数据可视化的内容 ',
        points: ['Angular', 'D3', 'HighChart'],
    },
    {
        date: '2014-06',
        company: '医渡云技术有限公司',
        product: '医渡app',
        description:
            'app采用了前端框架ionic开发，ionic以angular为基础，app中登录，以及健康问卷内容，套餐等内容均由本人开发 开发过程还使用了sass,jade等前端的预处理工具，bower前端的包管理工具，gulp前端的自动化构建工具 ',
        points: ['Angular', 'D3', '手机端', 'Ionic', 'Gulp'],
    },
    {
        date: '2014-02',
        company: '翼燊恒通科贸有限公司',
        description: 'PHP和页面开发, 主要工作根据设计稿精准还原页面',
        points: ['PHP', 'SEO'],
    },
]

const getLatestYearsExp = (count: number) => {
    return experiences.filter(e => {
        if (/^\d{4}/.test(e.date)) {
            return parseInt(e.date) >= new Date().getFullYear() - count
        }
        return true
    })
}
</script>
